In [1]:
import pandas as pd
import numpy as np

b2 = pd.read_csv('basic2.csv')
b2.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [5]:
b2['Date'] = pd.to_datetime(b2['Date'])
#인덱스 설정
b2 = b2.set_index('Date')

In [6]:
b2.head()

               Sales      PV      UV  Events
Date
2022-01-01  22711525  397349  4421.0       1
2022-01-02     36779    3969  2289.0       0
2022-01-03  13943875  373890     NaN       1
2022-01-04   8088593  142054  2157.0       0
2022-01-05   2395374  190684     NaN       0

In [7]:
#주단위로 변환
b2_w = b2.resample('W').sum()
b2_w.head()

               Sales       PV       UV  Events
Date
2022-01-02  22748304   401318   6710.0       1
2022-01-09  33373822  1148464  15189.0       2
2022-01-16  20754519   283773   9344.0       0
2022-01-23  21880751   538633   9841.0       1
2022-01-30  28878452   560814   7808.0       1

In [8]:
ma = b2_w['Sales'].max()
mi = b2_w['Sales'].min()

In [9]:
print(ma-mi)

91639050